app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "blah blah blah"], ["user_id", 2], ["created_at", "2015-08-07 14:22:19.107445"], ["updated_at", "2015-08-07 14:22:19.107445"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save